regex1 = r"JavaScript|C\+\+|Python"

regex2 = r"(?<![а-яё])(?:[Дд]а|[Нн]ет|[Нн]аверное)(?![а-яё])"
# или    r"\b(?:[Дд]а|[Нн]ет|[Нн]аверное)\b"

regex3 = r"\b(?P<prefix>1|3|bc1)(?P<main>[a-km-zA-HJ-NP-Z1-9]){27,34}\b"
# или    r"\b(?:1|3|bc1)(?:[a-km-zA-HJ-NP-Z1-9]){27,34}\b"

regex4 = r"(?:Привет|Пока), (?:Олег|Григорий)"

regex5 = r"\b(?:(?:я|ты) готова?|он готов|она готова|(?:мы|вы|они) готовы)\b"

# или    r'\b(?:(?:я|ты) готова?|он(а?) готов\1|(мы|вы|они) готовы)\b'

regex6 = r"(?:(?<=№ )|(?<=Номер )|(?<=Number ))\d{3}\b"
# т.к. lookbehind разной длины приходится использовать (?: ()|()|())




