regex1 = r"any"

regex2 = r"\b[Тт]ы\b"

regex3 = r"#[0-9A-Fa-f]{6}\b"

regex4 = r"(?<![\d.])(?:0(?:\.\d{1,2})?|1)(?![\d.])"

regex5 = r"\b[б-яБ-ЯёЁ]*а[а-яА-ЯёЁ]*\b"

regex6 = r"[а-яА-ЯёЁ]+(?=[.,:?!;])"

regex7 = r"[а-яА-ЯёЁ]+[^а-яА-ЯёЁ\s.?!,][\w$]*|[^а-яА-ЯёЁ\s.?!,]+[а-яА-ЯёЁ][\w$]*"

regex8 = r"^[а-яА-ЯёЁ-]+"
# или   r"(?<=^)[а-яА-ЯёЁ-]+"

regex9 = r"(?:(?<= )|(?<=^))[Nn][a-zA-Z-]*(?= |$)"
# или    r"(?<!\S)[Nn][a-zA-Z-]*(?= |$)"

regex10 = r"\b[a-z]+(?:[A-Z][a-z]*)*\d*\b"

regex11 = r"\b[a-z]+(?:_[a-z]*)*\d*\b"

regex12 = r"(?:(?<=\s)|(?<=^))[a-zA-Z][a-zA-Z0-9_]{3,30}[a-zA-Z0-9](?=\s|$)"
# или     r"(?<!\S)[a-zA-Z][a-zA-Z0-9_]{3,30}[a-zA-Z0-9](?=\s|$)"

regex13 = r"(?:(?<!\S)|(?<=[/\\]))[a-zA-Z0-9-]+\.[a-zA-Z0-9]+(?=[\s/\\]|$)"

regex14 = r"(?<=v=)[a-zA-Z0-9_]*"

regex15 = r"\[(?:\d+, ?)*(?:\d+ ?)?\]"
